app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 5]]
---
  def show
    render json: Student.find(params[:id])