api/app/controllers/cohorts_controller.rb

SELECT "cohorts".* FROM "cohorts"
---
  def index
    cohorts = Cohort.all

SELECT  "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "students".* FROM "students" WHERE "students"."cohort_id" = $1  [["cohort_id", 1]]
---
  def show
    render json: Cohort.find(params[:id]).students